#define  _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
/*
int main()
{
	char a[1000]; 
	int i; 
	for (i = 0; i<1000; i++) 
	{ 
		a[i] = -1 - i;
	}
	printf("%d", strlen(a));
	return 0;
}
*/




/*
#include<windows.h>
//代码结果是循环
//无符号数永远为正数，永远大于零
int main()
{
	 unsigned int i;
	for (i = 9; i >= 0; i--)
	{ 
		printf("%u\n", i);
		sleep(100);
	}
	return 0;
}
*/




/*
int main() 
{
	char a = -128; //有符号                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            
	//原码
	//反码
	//补码
	//截取8个补码的比特位  
	//11111111111111111111111111111111110000000（补码）——整型提升后的结果
	//打印为无符号是，所以结果为
	printf("%u\n", a);
	//%d 打印十进制有符号数字
	//%u 打印十进制无符号数字
	return 0;
}

*/









/*
//运行结果为 -1  -1  255  为什么
int  main()
{
	char a = -1;
	//存入为补码：
	//原——1000000000000000000000000001
	//反——1111111111111111111111111110
	//补——1111111111111111111111111111
	//char类型只能存放一个字节，也就是8个比特位
	//1  111 1111——有符号位
	signed char b = -1;
	//1  111 1111——有符号位
	unsigned char c = -1;
	//11111111——无符号位
	printf("a=%d,b=%d,c=%d", a, b, c);
	/*
	   1.char为有符号的char  并且输出结果为int  所以会发生整型提升
	   提升之后结果为1111111111111111111111111111——反——原结果为-1
	   2.同理
	   3.无符号数整型提升填0，0000000000000000000011111111
	
	return 0;
}

*/




/*

//使用函数方式：写一段代码指出当前电脑的字节序是什么
int main()
{

	return 0;
}

/*
   指针类型的意义
   1.指针类型决定了指针解引用操作符能访问几个字节，char* p    *p只能访问一个字节  int* p   *p访问4个字节
   2.指针类型决定了指针+1，-1加的或者减的是几个字节  char* p    *p只能跳过一个字节
   

*/



/*
//写一段代码指出当前电脑的字节序是什么
int main()
{
	//假设  int a = 20；
	//0x 00 00 00 14

	//小端存储：00 00 00 14
	//大端存储：14 00 00 00 
	//实现办法是这样的，将一个int类型的数据，改为char型，因为char型每次只能拿出一个字节的数据
	int a = 1;
	char* p = (char*)&a;
	if (*p = 1)
	{
		printf("小端\n");
	}
	else
	{
		printf("大端\n");
	}
	return 0;
}
*/







/*
int main()
{
	int a = 20;
	int b = -10;
	//在计算机中如何计算减法
	int a = 1 - 1;//1-1如何计算；计算机中只有加法器，1+（-1）
	//原码表示：
	//00000000000000000000000000000001
	//10000000000000000000000000000001
	//10000000000000000000000000000010
	//结果等于-2  不对，因此出现补码概念
	//补码表示
	//00000000000000000000000000000001——1的 原 反  补 相同
	//11111111111111111111111111111111——（-1）的补码
   //100000000000000000000000000000000——相加结果（一共33位 丢弃最高位）

	return 0;
}
*/







/*
void  text()//虽然传参100  但无法接收  还是打印一个hehe
//void  text(void)//这种写法不用传参的意思
{
	print("hehe \n");
}
int main()
{
	text(100);
	return 0;
}
*/



/*
int main()
{
	int a = 10; //4字节
	float f = 10.0;//4字节
	//虽然都是4个字节，存储方式不一样；
	//以下两种方式都行，int可以省略
	int arr[10] =  { 0 };
	//int [10] int [5]——char[5]   不带数组名就是数组类型  
	short int a = 10;
	short b = 10;
	return 0;
}
*/