#include<stdio.h>
int main()
{
    int a = 20;
	//00000000000000000000000000010100
	//16进制：0x00 00 00 14
	return 0;
}






/*
int main()
{
    int a = 20;//4个字节32个比特位，
	//00000000000000000000000000010100——原码
	//00000000000000000000000000010100——反码
	//00000000000000000000000000010100——补码
	//4个二进制为转换一个16进制位
	//将补码转换为16进制结果0x00000014
	int b = -10;
	//10000000000000000000000000001010——原码
	//11111111111111111111111111110101——反码
	//11111111111111111111111111110110——补码
	//补码二进制换算为16进制：0xFFFFFFF6
	return 0;
}

int main()
{
     1-1;//计算机中只有累加器。无法计算减法操作
	 //1+(-1)
    //1的原码：     00000000000000000000000000000001
	//（-1）的原码：10000000000000000000000000000001
    //相加结果为-2是错误的；
   //以上错以下方法对：
    //（-1）的补码 :11111111111111111111111111111111
    //与1的原码相加：结果：100000000000000000000000000000000  //33位
	 //计算机只能存32为丢出去最高位：00000000000000000000000000000000
	 //结果对为 0 
	 //补码就是为了将加减使用同一种方法；
	return 0;
}
*/







/*
void test(viod)//无返回空类型
{

	printf("hehe\n")
}

int main()
{
    test(100);//这个100没有用,
	return 0;
}
*/






/*
{
    int a = 10;//4字节
	float f = 10.0;//4字节
	return 0;

}
*/